# CreateLogicalOfType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCData..::..CreateLogicalOfType Method
IFCData Class See Also
---
Creates a logical data object of the specified type.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static IFCData CreateLogicalOfType(
	IFCLogical value,
	string typeName
)
```

Visual Basic
---
```text
Public Shared Function CreateLogicalOfType ( _
	value As IFCLogical, _
	typeName As String _
) As IFCData
```

Visual C++
---
```text
public:
static IFCData^ CreateLogicalOfType(
	IFCLogical value,
	String^ typeName
)
```

# ### Parameters
value
    Type: Autodesk.Revit.DB.IFC..::..IFCLogical The IFCLogical value.
typeName
    Type: System..::..String The type name.
# ### Return Value
The IFCData object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace